{
  "applications": [
    {
      "empresa": "Tivit",
      "vaga": "Desenvolvedor Full Stack Pleno",
      "linkVaga": "https://www.linkedin.com/jobs/view/4353110502/?eBP=CwEAAAGbwjbVhRd0Gz5283nlHt62DvUIivvXMsV0NlPCmCxVgKgmnBjssdjiglwM6sM7YbqNwAl5bf_iEzBMQUZ5mKvYQuVf9T940p5AZSzxbPylIFtDDrZ7IrHdlFYx9EfR-J4rAZ_dC3eE94Sgi_NSKpNxYll0t5q9lLhoY0WcqHPI14WLglkA4Y-Db6lh4SiD5utEtnsZhvEEAc1QnYF-tS8s6OsoyBZ-HhOAPP7m7yyIVZ4_t4ipSaC2Qu30s4oQzX4C5Kt4_uvO_97AIRJ7JHqMBzMrCCWJV9jpqXBmKXTX39SltfEjK5opNo_zITytkaMHyMX3eRb6YRTiPiOuNWPtlrcyL939DPn_6X2gfmbN7tOQlxaMEOzeHIY1o-AnaqoZKUSQ5BFI43xTyB3PW7BYHSNDsJ2t-nQZgkA2vYlnjYe7th2DaPmuk2QPUKYpStSZnPKnogR37UFwpts3vrKK-F0_zNiIfJJw6qGxBAM2Ntiux7nB2WQMnRTRn6o1TAu1fuV7lhSugYsHtkGOUif9UxmUjNtYoj6_j86F5w&refId=fjfqUsxfldlXmtjMMVRe1g%3D%3D&trackingId=1xvYe%2BswVIVLbT8wi2xYFw%3D%3D&trk=flagship3_search_srp_jobs&lipi=urn%3Ali%3Apage%3Ad_flagship3_search_srp_jobs%3BDcelI06ESbu4ncU0MfMivQ%3D%3D&lici=1xvYe%2BswVIVLbT8wi2xYFw%3D%3D",
      "dataCandidatura": "2026-01-15",
      "stack": [
        "Java",
        "OOP",
        "React",
        "Angular",
        "Kubernets",
        "Spring Cloud",
        "Kafka",
        "Microserviços",
        "Clean Code",
        "Git",
        "Scrum",
        "Kanban",
        "NoSQL",
        "Spring WebFlux",
        "JUnit",
        "Mockito",
        "WireMock",
        "Jenkins",
        "ci/cd",
        "Consul",
        "AWS",
        "Dynatrace",
        "Prometheus",
        "Grafana",
        "Spring Cloud Stream"
      ],
      "etapa": "Enviei candidatura",
      "senioridade": "Pleno",
      "local": "Brasil",
      "tipoVaga": "Remoto",
      "observacoes": "",
      "description": "Sobre a vaga\nBuscamos um(a) Desenvolvedor(a) Fullstack Pleno para atuar em um ambiente de alta complexidade e inovação, contribuindo na evolução e modernização de uma plataforma digital estratégica. Você fará parte de um time de produto orientado à entrega de valor, com autonomia, colaboração e foco em impacto real para o negócio.\n\n\nO contexto envolve modernização de sistemas críticos, cultura orientada a times, participação ativa nas decisões técnicas e trabalho com tecnologias modernas em arquitetura distribuída.\n\n\nA posição é 100% remota. Contratação CLT.\n\n\nResponsabilidades e Atribuições\n\nDesenvolver soluções back-end utilizando Java, programação orientada a objetos e Design Patterns.\nAtuar no desenvolvimento front-end com React e/ou Angular.\nCriar e manter APIs e serviços REST.\nAplicar boas práticas de desenvolvimento, padrões arquiteturais e princípios SOLID.\nTrabalhar com Kubernetes, Spring Cloud e integrações utilizando Kafka.\nDesenvolver aplicações baseadas em microserviços e arquitetura distribuída.\nRealizar testes unitários e apoiar práticas de clean code e code review.\nUtilizar Git para versionamento e colaboração entre times.\nParticipar de cerimônias e rotinas de times ágeis (Scrum/Kanban).\nContribuir na concepção colaborativa de produtos.\n\n\nRequisitos e Qualificações\n\nObrigatórios:\n\nExperiência com Java, orientação a objetos e Design Patterns.\nExperiência com React e/ou Angular.\nExperiência com desenvolvimento de APIs REST.\nVivência com Kubernetes, Spring Cloud, Kafka e microserviços.\nConhecimento em testes unitários, práticas de code review e princípios SOLID.\nUso de Git no dia a dia.\nAtuação em times ágeis.\n\n\nDesejáveis:\n\nConhecimentos em bancos de dados Relacionais e Não Relacionais (NoSQL).\nArquitetura orientada a eventos.\nSpring WebFlux.\nJUnit, Mockito e WireMock.\nExperiência com design system.\nIntegração contínua e automação.\n\n\nDiferenciais\n\nJenkins / pipelines CI/CD\nConsul\nAWS (ECS, SQS, S3)\nDevConsole\nSpring Cloud Stream\nFerramentas de observabilidade: Dynatrace, Prometheus, Grafana, OpenTelemetry",
      "id": "6e9a3a13-ead1-41a5-8c82-f8d68e7f1562",
      "tempoProcesso": 0,
      "updatedAt": "2026-01-15T15:20:12.935Z"
    },
    {
      "empresa": "Omie",
      "vaga": "Desenvolvedor(a) Fullstack",
      "linkVaga": "https://www.linkedin.com/jobs/view/4363595781/",
      "dataCandidatura": "2026-01-28",
      "stack": [
        "HTML",
        "CSS",
        "Javascript",
        "Vue.j",
        "FastAPI",
        "SQLAlchemy",
        "Git"
      ],
      "etapa": "Enviei candidatura",
      "senioridade": "Júnior",
      "local": "Brasil",
      "tipoVaga": "Remoto",
      "observacoes": "",
      "description": "A Omie tem como propósito trazer prosperidade para o ecossistema empreendedor brasileiro. Por isso, buscamos por pessoas com mentalidade de crescimento, valorizando perfis que tenham capacidade de adaptação, senso colaborativo e sejam motivadas pela inovação e pelo aprendizado contínuo.\n\n\nFaça parte da história de uma das empresas de tecnologia que mais cresce no país! 🚀\n#VempraOmie\n\n\n\nResponsabilidades e atribuições\n\nTrabalhar no desenvolvimento de novas interfaces de usuário, traduzindo os requisitos do produto e os designs gráficos em código funcional e responsivo.\nManter e aprimorar os nossos produtos, garantindo que estejam atualizados, sejam escaláveis e funcionem bem em todas as plataformas e dispositivos.\nColaborar com a equipe de back-end para integrar as APIs e os serviços de back-end e garantir uma experiência do usuário final sem interrupções.\nAuxiliar na criação de bibliotecas e frameworks reutilizáveis para futuros usos.\nIdentificar e solucionar problemas de performance e gargalos para melhorar a experiência do usuário.\nParticipar em reuniões de revisão de código, compartilhar conhecimentos e aprender com colegas de equipe.\nRealizar testes de unidade e de interface do usuário para garantir a funcionalidade do produto\n\n\nRequisitos e qualificações\n\nProfundo conhecimento de HTML, CSS, e JavaScript.\nExperiência prática com o framework Vue.js.\nConhecimento da linguagem de programação Python.\nDesejável contato com frameworks FastAPI e SQLAlchemy.\nExperiência com bancos de dados relacionais e não relacionais.\nFamiliaridade com a ferramenta de versionamento de código GitHub e com metodologias de desenvolvimento Ágil.\nHabilidade para desenvolver soluções web.\nFlexibilidade para atuar em um ambiente dinâmico e capacidade de se adaptar a mudanças de prioridades.\nAtenção aos detalhes, habilidade para gerenciar vários projetos simultaneamente e cumprir prazos.\nExcelentes habilidades de comunicação verbal e escrita (o conhecimento de inglês é um plus).\nAtitude proativa e colaborativa, com forte foco em resultados.\nFormação em Ciência da Computação ou curso relacionado (não obrigatório, mas preferencial).\n\n\nInformações adicionais:\n\n🍴 Benefício Flexível/VR: R$ 40,00/dia útil.\n💻 Auxílio Home office.\n🚍 Precisa trabalhar presencialmente? Nós temos vale-transporte. E para você que vem de trem/metrô disponibilizamos um fretado na estação para deslocamento até o escritório.\n🏪 Plano de saúde Bradesco.\n🦷 Plano odontológico Amil Dental.\n💊 Auxílio Farmácia.\n🍼 Auxílio-creche.\n🏖️ Day off de aniversário, para você comemorar como quiser!\n🏋️ ♀️ Para manter a saúde e o bem-estar físico em dia, contamos com Apps parceiros de academias credenciadas.\n🧘 Para relaxar e cuidar da saúde mental, temos parcerias com plataformas de terapia e meditação online.\n🎭 Parceria com o SESC - Credencial Plena\n📚 Descontos exclusivos nas melhores faculdades e instituições de ensino, voltados para cursos de graduação, pós-graduação e MBA. Além de disponibilizarmos o Omie Academy gratuito para colaboradores.\n📚 Parceria com cursos de English in Company.\n🔒 Programa de descontos em seguros.\n💰 Swile Shop: plataforma de descontos exclusivos.\n💰 Parceria com a Dell: cupons de até R$ 2.000,00.\n💰 PPRL.\n✈️ Benefícios de viagens.\n💙 Seguro de vida.",
      "id": "4eae2915-b761-4a63-94b4-7e49dc5e0c11",
      "tempoProcesso": 0,
      "updatedAt": "2026-01-28T18:51:22.268Z"
    },
    {
      "empresa": "BeFly",
      "vaga": "Analista de Desenvolvimento Pl - BeFly",
      "linkVaga": "https://www.linkedin.com/jobs/view/4344141596/",
      "dataCandidatura": "2026-01-28",
      "stack": [
        "Node.js",
        "Python",
        "SQL Server",
        "React.js"
      ],
      "etapa": "Enviei candidatura",
      "senioridade": "Pleno",
      "local": "Brasil",
      "tipoVaga": "Remoto",
      "observacoes": "",
      "description": "Descrição da vaga\nSomos o ecossistema de turismo mais transformador na vida de cada pessoa! A paixão por viagens está em nosso DNA.\nNossos escritórios proporcionam um ambiente moderno e pensado para uma melhor experiência de trabalho presencial. Somos múltiplos e diversos, gostamos de trabalhar com gente do bem, de forma inteligente, prática, ousada, inovadora e com tudo isso, buscamos o extraordinário.\nValorizamos as conexões reais e ambientes leves, seja através do cafezinho no meio de expediente ou aquele papo, que sempre gera novas ideias.\nO que nos move é a transformação e nosso lema é criar caminhos além do imaginável!\nIsso nos torna BeFly. E aí, você vem com a gente? \n#VemSerBeFly \nResponsabilidades e atribuições\nConfira As Principais Atividades Desta Vaga\nPlanejar e desenhar melhores soluções para integrações de sistemas e aumento de eficiência operacional e financeira em conjunto com os usuários finais.\nIntegrar ferramentas de terceiros como Wooba, Travel Compositor e Niara.\nDesenvolver ferramentas em NodeJS ou Python com banco de dados em SQL Server.\nDar suporte a aplicações legadas e aumentar a robustez de sistemas já em produção.\nRequisitos e qualificações\nCurtiu?! Vamos em frente, entenda o que esperamos de você:\nExperiência prévia com desenvolvimento de aplicações backend em linguagens Javascript;\nConhecimento de frameworks de desenvolvimento e melhores práticas de arquitetura;\nConhecimento avançado em NodeJS ou Python;\nBom conhecimento em aplicação frontend em React;\nInglês para análise de documentação e manuais estrangeiros;\nInformações adicionais\nQuais os benefícios de ser BeFlyer?\nVR iFood Benefícios | Para que você se alimente bem.\nAssistência médica Bradesco | Mensalidade 100% paga pela BeFly ao colaborador titular e 50% para dependentes, com comparticipação.\nSeguro de vida | Sem custo para o colaborador.\nAssistência odontológica | OdontoPrev.\nWellhub | Para você cuidar da sua saúde física.\nDay off de aniversário | Um dia de descanso no seu aniversário.\nPrograma Oriente-me | Sessões de terapia sem custo adicional.\nConvênios educacionais | Descontos em instituições de ensino parceiras.\nBeFlyers Travel | Agência de lazer interna com condições especiais para colaboradores.\n#BeFly\nCriamos caminhos além do imaginável — e o próximo pode ser o seu!\nA BeFly é um ecossistema de empresas de turismo e tecnologia, fundado em outubro de 2021, que reúne marcas com mais de 40 anos de história. Estamos presentes em todo o Brasil, com cerca de 2.000 colaboradores e soluções que atendem viajantes individuais, empresas e eventos, conectando pessoas, tecnologia e propósito.\nSomos apaixonados por clientes, resultados e por criar experiências que marcam para sempre. Aqui, inovação e desenvolvimento caminham juntos. Nosso ambiente é dinâmico, acolhedor e cheio de oportunidades para quem quer crescer e fazer a diferença no futuro do turismo.\nSe você busca uma jornada com significado, espaço para aprender e transformar, a BeFly é o seu lugar.\n🚀 Clique aqui e explore o universo BeFly.",
      "id": "d5d5f4d5-a8af-4154-80ef-4b219320bb43",
      "tempoProcesso": 0,
      "updatedAt": "2026-01-28T18:53:43.778Z"
    },
    {
      "empresa": "FCamara",
      "vaga": "Desenvolvedor(a) Python Pleno com foco em GenAI",
      "linkVaga": "https://www.linkedin.com/jobs/view/4366680238/",
      "dataCandidatura": "2026-01-28",
      "stack": [
        "Python",
        "SQL",
        "GenAI",
        "Git",
        "GCP",
        "Azure DevOPS"
      ],
      "etapa": "Enviei candidatura",
      "senioridade": "Pleno",
      "local": "Brasil",
      "tipoVaga": "Remoto",
      "observacoes": "",
      "description": "Descrição da vaga\n\nA FCamara está em busca de uma pessoa Desenvolvedor(a) Python Pleno com foco em GenAI, para se juntar a nossa equipe dinâmica e atuar em parceria com a maior construtora da América Latina, que ao longo de sua existência, sempre esteve sintonizada com o mercado e as melhores práticas, além de priorizar sempre as necessidades de seus clientes. É uma empresa que está em constante movimento, se reinventando a cada dia para oferecer soluções de moradia para todas as gerações.\n\nSobre o Time:\n\nNosso time é o motor da transformação digital e o principal responsável pela disseminação do uso de Inteligência Artificial em toda a companhia. Além da governança técnica (Python e Power BI), lideramos o desenvolvimento de soluções avançadas de GenAI e Low Code (Power Platform e n8n), entregando desde diversos assistentes conversacionais integrados ao WhatsApp até agentes autônomos executores de tarefas, além de inúmeras outras ferramentas.\n\nAtuamos de forma transversal: recebemos demandas e desafios de todas as áreas de negócio e da TI, e nossa missão não é apenas solucionar problemas, mas sim transformar necessidades pontuais em produtos escaláveis. Gerimos uma plataforma interna de criação de assistentes virtuais e ferramentas que democratizam o uso da IA para milhares de colaboradores. Se você gosta de transformar uma dor operacional em uma solução que impacta milhares de pessoas, aqui é o seu lugar.\n\nResponsabilidades e atribuições\n\nPrincipais Responsabilidades\n\nCriar e manter APIs que alimentam nossa plataforma e nossos assistentes.\nDesenvolver aplicações internas desenvolvidas em Streamlit, garantindo robustez e usabilidade para as áreas de negócio.\nDesenvolver agentes autônomos em Python para executar tarefas transacionais e automações complexas.\nAtuar como avaliador técnico de scripts Python desenvolvidos pelas áreas de negócio, garantindo segurança, qualidade e padronização antes da liberação.\nDesenvolver rotinas de processamento assíncrono (workers/functions na Azure) para lidar com grandes volumes de dados e requisições.\n\nRequisitos Obrigatórios\n\nSólida experiência com Python.\nExperiência em construção de APIs.\nExperiência com RPA.\nConhecimento em Bancos de Dados Relacionais e linguagem SQL.\nPráticas de engenharia de software: Git, Testes Automatizados e Code Review.\nConhecimento ou forte interesse em arquitetura de Agentes e LLMs.\n\nDiferenciais\n\nExperiência com frameworks de GenAI como LlamaIndex e LangChain.\nExperiência com desenvolvimento de RAG, Tools e MCP.\nExperiência com Streamlit para front-end.\nExperiência com processos Assíncronos, Paralelos e Filas.\nManipulação de dados com Pandas.\nVivência com ferramentas Low Code (principalmente N8N).\nExperiência com automação para SAP HANA.\nConhecimento em CI/CD.\nFamiliaridade com GCP e/ou Azure DevOps.\n\nPerfil Comportamental\n\nAgilidade e Pivotagem: O time testa muitas hipóteses. É preciso saber mudar de direção rápido quando um projeto requer adaptação.\nVisão de Escala: Capacidade de olhar para um chamado específico e enxergar uma oportunidade de criar um produto que sirva para toda a companhia.\nProatividade: Vontade de aprender e implementar as inovações que chegam ao mercado (novos modelos, frameworks, técnicas de RAG).\nComunicação Ativa: O time é pequeno e integrado. Você precisará trocar informações constantemente.\n\nTransformamos mundos sonhados em trajetórias reais.🧡🚀\n\nAqui somos #SangueLaranja!\n\nEstamos há 17 anos no mercado, lado a lado com nossos clientes, proporcionando experiências transformadoras.\n\nSomos um ecossistema de tecnologia e inovação, com expansão global; Além do Brasil estamos presentes na Europa e Reino Unido com escritórios em Portugal, Londres, Dubai e Holanda. 🌎\n\nF de Formação: acreditamos na prática da cultura do compartilhamento, no senso de comunidade, e que o conhecimento\n\ntem o poder da transformação!\n\nPossuímos iniciativas, e ações sociais, que promovem o desenvolvimento, como a comunidade tech Orange Juice, o Programa de Formação,\n\nnossa escola de liderança e diversas parcerias com ONGs e Edtechs.\n\nNa FCamara todos são bem-vindos, para nós, Diversidade, Respeito e Ética, são elementos inegociáveis e fazem parte do nosso DNA. \n\nE aí, está pronto para fazer parte de um time incrível e ser protagonista da própria história?",
      "id": "0ac08ebe-c04d-4145-a40b-5ef3fa17cfa0",
      "tempoProcesso": 0,
      "updatedAt": "2026-01-28T19:18:17.192Z"
    },
    {
      "empresa": "PetLove",
      "vaga": "Dev Backend Pleno",
      "linkVaga": "https://www.linkedin.com/jobs/view/4366358785/",
      "dataCandidatura": "2026-01-28",
      "stack": [],
      "etapa": "Enviei candidatura",
      "senioridade": "Pleno",
      "local": "Brasil",
      "tipoVaga": "Remoto",
      "observacoes": "",
      "description": "Sobre a vaga\nSomos uma empresa de tecnologia movida por nossa paixão por animais de estimação! 💜\n\nNosso trabalho diário é tornar a vida dos pais dos animais de estimação mais fácil por meio de uma experiência única de aprender, fazer compras e consumir o que eles precisam, a qualquer hora. Sempre centrado no que é melhor para a felicidade e saúde dos animais de estimação.\n\nA Petlove já é a maior empresa de tecnologia na indústria pet do Brasil. Recentemente, adicionamos ao nosso portfólio empresas estratégicas como DogHero, VetSmart, Vetus e Porto.pet para animais de estimação, a fim de perseguir nossa visão de criar o maior ecossistema de animais de estimação do Brasil.\n\nTemos muito orgulho de já ter atendido mais de 5 milhões de clientes em todo o país, mas ainda estamos famintos pelo que vem por aí (o Brasil tem mais de 48 milhões de domicílios com animais de estimação). Se você está procurando uma oportunidade única na vida, adora tecnologia e é realmente apaixonado por animais de estimação, somos perfeitos um para o outro!\n\nPrincipais Atividades\n\nAtuação em uma squad com foco nos sistemas que atendem toda a companhia.\nTrabalhar em equipe multidisciplinar, usando metodologia ágil para criação e evolução de produtos;\nEntender os objetivos do negócio e transformá-los em soluções sistêmicas;\nEstimar o esforço necessário para o desenvolvimento do sistema;\nRealizar revisão de código para garantir que respeitam as boas práticas de programação.\nEscrever código limpo, reutilizável e de fácil manutenção;\nImplementar testes unitários e de integração para garantir a qualidade do código desenvolvido;\nAjudar a criar arquiteturas escaláveis;\nSe responsabilizar pelo desenvolvimento, deploy, documentação e monitoramento dos sistemas;\n\nResponsabilidades\n\nDesenvolver e manter fluxos de IA usando LangGraph e LangChain.\nEscrever e manter código em Python, com foco em integrações com modelos de linguagem (LLMs).\nParticipar do design e implementação de agentes\nTrabalhar em conjunto com engenheiros de software, cientistas de dados e product managers.\nColaborar na documentação e testes de fluxos de IA.\n\nRequisitos\n\nConhecimento em Python (sintaxe, estruturas de dados, boas práticas).\nNoções básicas de APIs REST e estruturas de dados em JSON.\nConhecer conceitos de IA generativa e LLMs.\nExperiência com LangGraph, LangChain, OpenAI API, ou similares.\nExperiência com versionamento (Git) e observabilidade (honey bagder, datadog)\n\nSomos o maior ecossistema pet do Brasil, unidos por um propósito: transformar o mundo em um lugar onde os pets sejam mais felizes e saudáveis. Pioneiros no digital, oferecemos tudo o que o seu pet precisa, em um só lugar: e-commerce, app, lojas físicas, planos de saúde pet, creche, hospedagem e muito mais! Estamos sempre inovando com tecnologias que empoderam médicos veterinários e contamos com a maior referência em diagnósticos rápidos e de alta qualidade.\n\nE você, vem fazer parte dessa missão com a gente?\n\nNosso jeito de trabalhar\n\nNa Petlove nós somos apaixonados por pets e por pessoas. Por isso, buscamos garantir que somos inclusivos e formamos times diversos, sempre procurando refletir em nossas decisões nosso compromisso com esse tema! Consideramos enriquecedor contratar pessoas com deficiência, de gêneros e orientação sexual diversas, incluindo todas as etnias e religiões, além de todas as idades e demais marcadores de identidade. Temos certeza que só assim formaremos times inconformados, ágeis e comprometidos com o nosso propósito.\n\nSe identificou? Então vem com a gente!\n\nOnde tem pet, tem love — só falta você!\n\nQuer saber mais sobre a Petlove e nossos benefícios? Não perca a chance de conferir nossa página de carreiras: https://petlove.jobs.recrut.ai/",
      "id": "026ad501-c24c-48ce-b79d-2c78a68f08ff",
      "tempoProcesso": 0,
      "updatedAt": "2026-01-28T19:35:45.262Z"
    }
  ],
  "settings": {
    "baseResume": "%-------------------------\n% Resume in Latex\n% Author : Vaishanth\n% License : MIT\n%------------------------\n\n\\documentclass[letterpaper,11pt]{article}\n\n\\usepackage{latexsym}\n\\usepackage[empty]{fullpage}\n\\usepackage{titlesec}\n\\usepackage{marvosym}\n\\usepackage[usenames,dvipsnames]{color}\n\\usepackage{verbatim}\n\\usepackage{enumitem}\n\\usepackage[hidelinks]{hyperref}\n\\usepackage[english]{babel}\n\\usepackage{tabularx}\n\\usepackage{fontawesome5}\n\\usepackage{multicol}\n\\usepackage{graphicx}%\\setmainfont{Times New Roman}\n\\setlength{\\multicolsep}{-3.0pt}\n\\setlength{\\columnsep}{-1pt}\n\\input{glyphtounicode}\n\n\\RequirePackage{tikz}\n\\RequirePackage{xcolor}\n\n\\definecolor{cvblue}{HTML}{0E5484}\n\\definecolor{black}{HTML}{130810}\n\\definecolor{darkcolor}{HTML}{0F4539}\n\\definecolor{cvgreen}{HTML}{3BD80D}\n\\definecolor{taggreen}{HTML}{00E278}\n\\definecolor{SlateGrey}{HTML}{2E2E2E}\n\\definecolor{LightGrey}{HTML}{666666}\n\\colorlet{name}{black}\n\\colorlet{tagline}{darkcolor}\n\\colorlet{heading}{darkcolor}\n\\colorlet{headingrule}{cvblue}\n\\colorlet{accent}{darkcolor}\n\\colorlet{emphasis}{SlateGrey}\n\\colorlet{body}{LightGrey}\n\n%----------FONT OPTIONS----------\n% sans-serif\n% \\usepackage[sfdefault]{FiraSans}\n% \\usepackage[sfdefault]{roboto}\n% \\usepackage[sfdefault]{noto-sans}\n% \\usepackage[default]{sourcesanspro}\n\n% \\usepackage[T1]{fontenc}\n% \\usepackage[T1]{fontenc}\n% \\usepackage{cochineal}\n% \\usepackage{fourier}\n\n% \\usepackage{fontspec}\n% \\usepackage{polyglossia}\n% \\setmainlanguage{german}\n% \\setmainfont{Times New Roman}\n\n% serif\n\\usepackage{CormorantGaramond}\n\\usepackage{charter}\n\n% \\pagestyle{fancy}\n% \\fancyhf{}  % clear all header and footer fields\n% \\fancyfoot{}\n% \\renewcommand{\\headrulewidth}{0pt}\n% \\renewcommand{\\footrulewidth}{0pt}\n\n% Adjust margins\n\\addtolength{\\oddsidemargin}{-0.6in}\n\\addtolength{\\evensidemargin}{-0.5in}\n\\addtolength{\\textwidth}{1.19in}\n\\addtolength{\\topmargin}{-.7in}\n\\addtolength{\\textheight}{1.4in}\n\\urlstyle{same}\n\n\\definecolor{airforceblue}{rgb}{0.36, 0.54, 0.66}\n\n\\raggedbottom\n\\raggedright\n\\setlength{\\tabcolsep}{0in}\n\n% Sections formatting\n\\titleformat{\\section}{\n  \\vspace{-4pt}\\scshape\\raggedright\\large\\bfseries\n}{}{0em}{}[\\color{black}\\titlerule \\vspace{-5pt}]\n\n% Ensure that generate pdf is machine readable/ATS parsable\n\\pdfgentounicode=1\n\n%-------------------------\n% Custom commands\n\\newcommand{\\resumeItem}[1]{\n  \\item\\small{\n    {#1 \\vspace{-1pt}}\n  }\n}\n\n\\newcommand{\\classesList}[4]{\n    \\item\\small{\n        {#1 #2 #3 #4 \\vspace{-2pt}}\n  }\n}\n\n\\newcommand{\\resumeSubheading}[4]{\n  \\vspace{-2pt}\\item\n    \\begin{tabular*}{1.0\\textwidth}[t]{l@{\\extracolsep{\\fill}}r}\n      \\textbf{\\large#1} & \\textbf{\\small #2} \\\\\n      \\textit{\\large#3} & \\textit{\\small #4} \\\\\n      \n    \\end{tabular*}\\vspace{-7pt}\n}\n\n\n\\newcommand{\\resumeSingleSubheading}[4]{\n  \\vspace{-2pt}\\item\n    \\begin{tabular*}{1.0\\textwidth}[t]{l@{\\extracolsep{\\fill}}r}\n      \\textbf{\\large#1} & \\textbf{\\small #2} \\\\\n      \n    \\end{tabular*}\\vspace{-7pt}\n}\n\n\\newcommand{\\resumeSubSubheading}[2]{\n    \\item\n    \\begin{tabular*}{0.97\\textwidth}{l@{\\extracolsep{\\fill}}r}\n      \\textit{\\small#1} & \\textit{\\small #2} \\\\\n    \\end{tabular*}\\vspace{-7pt}\n}\n\n\n\\newcommand{\\resumeProjectHeading}[2]{\n    \\item\n    \\begin{tabular*}{1.001\\textwidth}{l@{\\extracolsep{\\fill}}r}\n      \\small#1 & \\textbf{\\small #2}\\\\\n    \\end{tabular*}\\vspace{-7pt}\n}\n\n\\newcommand{\\resumeSubItem}[1]{\\resumeItem{#1}\\vspace{-4pt}}\n\n\\renewcommand\\labelitemi{$\\vcenter{\\hbox{\\tiny$\\bullet$}}$}\n\\renewcommand\\labelitemii{$\\vcenter{\\hbox{\\tiny$\\bullet$}}$}\n\n\\newcommand{\\resumeSubHeadingListStart}{\\begin{itemize}[leftmargin=0.0in, label={}]}\n\\newcommand{\\resumeSubHeadingListEnd}{\\end{itemize}}\n\\newcommand{\\resumeItemListStart}{\\begin{itemize}[leftmargin=0.1in]}\n\\newcommand{\\resumeItemListEnd}{\\end{itemize}\\vspace{-5pt}}\n\n\\newcommand\\sbullet[1][.5]{\\mathbin{\\vcenter{\\hbox{\\scalebox{#1}{$\\bullet$}}}}}\n\n%-------------------------------------------\\usepackage{fontspec}\n%%%%%%  RESUME STARTS HERE  %%%%%%%%%%%%%%%%%%%%%%%%%%%%\n\n\n\\begin{document}\n%----------HEADING----------\n\n\n\\begin{center}\n    {\\huge Jean Gabriel Rodrigues Sardinha Frusca} \\\\ \\vspace{2pt} \n    {(21)98874-3639} ~ \n    \\small{-}\n    \\href{mailto:jeang96@gmail.com}{\\color{blue}{jeang96@gmail.com}} ~ \n    \\small{-}\n    \\href{https://www.linkedin.com/in/jean-gabriel-frusca/}{ \\color{blue}{Linkedin}}  ~\n    \\small{-}\n    \\href{https://github.com/jeangabrielrsf}{ \\color{blue}{Github}} ~\n    \\vspace{-7pt}\n\\end{center}\n\n % -----------EXPERIENCE-----------\n\\section{\\color{airforceblue}EXPERIÊNCIA}\n  \\resumeSubHeadingListStart\n\n    \\resumeSubheading\n        {Desenvolvedor de Software}{}\n        {Accenture Brasil, Rio de Janeiro, Brasil}{Dezembro/2024 - Atualmente}\n        \\resumeItemListStart\n            \\resumeItem{\\normalsize{Desenvolvo soluções empresariais inteligentes, atuando principalmente como backend, unindo IA Generativa com tecnologias como Python, Outsystem, Google BigQuery e AzureDevOps;}}\n            \\resumeItem{\\normalsize{Responsável pelo desenvolvimento de um chatbot capaz de analisar arquivos, montar uma query e extrair dados diretamente deles}}\n        \\resumeItemListEnd\n\n    \\resumeSubheading \n        {Estagiário em Desenvolvimento Full Stack}{}\n        {Equipe SIGA UFRJ, Rio de Janeiro, Brasil}{Março/2024 - Dezembro/2024}\n        \\resumeItemListStart\n            \\resumeItem{\\normalsize{Responsável por dar suporte e manutenção aos sistemas da Universidade Federal do Rio de Janeiro, utilizando as tecnologias JBoss SEAM e Java 8;}}\n            \\resumeItem{\\normalsize{Participação do time responsável na implementação de um novo sistema para integrar os alunos do ensino médio do Colégio de Aplicação - UFRJ, utilizando Spring, React e SQLServer2005.}}\n        \\resumeItemListEnd\n  \n\n    % \\resumeSubheading\n    %   {Treinamento Desenvolvedor Full Stack}{} \n    %   {Driven Education, Brasil}{Abril/2022 - Março/2023}\n    %   \\resumeItemListStart\n    %         \\resumeItem{\\normalsize{Participei de diversos projetos individuais e em grupo com a finalidade de aprender e aprimorar o meu desenvolvimento como programador. Utilizamos as seguintes tecnologias: React, Express.js, MongoDB, PostgreSQL, Node.js, PrismaORM e Jest;}}\n    %         \\resumeItem{\\normalsize{Aprendi metodologias ágeis utilizando Scrum;}}  \n    %         \\resumeItem{\\normalsize{Desenvolvi competências comportamentais através de aulas de soft skills.}}  \n    %   \\resumeItemListEnd  \n\n    % copy and paste above resumeSubheading block to add more \n  \\resumeSubHeadingListEnd\n\\vspace{-12pt}\n\n\n%-----------EDUCATION-----------\n\\section{\\color{airforceblue}EDUCAÇÃO}\n  \\resumeSubHeadingListStart\n    \\resumeSubheading\n        {Universidade Federal do Rio de Janeiro}{Rio de Janeiro, Brasil}\n        {Engenharia Eletrônica e de Computação}{Conclusão em Dezembro de 2026}\n        \\resumeItemListStart\n            \\resumeItem{\\normalsize{Desenvolvimento de projetos acadêmicos utilizando linguagens C, C++ e Pascal;}}\n            \\resumeItem{\\normalsize{Conhecimentos de arquitetura de computadores, algoritmos e lógica de programação, modelos ágeis e cascata;}}\n            \\resumeItem{\\normalsize{Introdução à programação orientada a objetos, testes, manutenção.}}\n        \\resumeItemListEnd\n    \\vspace{-4pt}\n    \\resumeSubheading\n        {Driven Education}{Remoto, Brasil}\n        {Desenvolvimento Web Full Stack}{2022 - 2023}\n        \\resumeItemListStart\n            \\resumeItem{\\normalsize{Formação Intensiva de +1.200h focadas em +25 projetos práticos;}}\n            \\resumeItem{\\normalsize{Front-end e back-end com as tecnologias web: React, Node.js, TypeScript e Prisma;}}\n            \\resumeItem{\\normalsize{Fundamentos da engenharia de software: lógica, algoritmos, estrutura de dados, POO, arquitetura, otimização, performance e clean code;}}\n            \\resumeItem{\\normalsize{Banco de dados relacionais e não relacionais com Postgres, Mongo e Redis;}}\n            \\resumeItem{\\normalsize{Princípios de DevOps com GitHub Actions, Docker e AWS;}}\n            \\resumeItem{\\normalsize{Testes unitários, integração e ponta a ponta com Jest e SuperTest;}}\n            \\resumeItem{\\normalsize{Trabalhos em equipe usando metodologias ágeis (Scrum), desenvolvimento de competências comportamentais.}}\n        \\resumeItemListEnd\n  \\resumeSubHeadingListEnd\n  \\vspace{-10pt}\n\n%-----------PROGRAMMING SKILLS-----------\n\\section{\\color{airforceblue}HABILIDADES}\n \\begin{itemize}[leftmargin=0in, label={}]\n    \\small{\\item{\n     \\textbf{\\normalsize{Front-end:}}{ \\normalsize{HTML, CSS, Javascript, React.js, Vue.js}} \\\\\n      \\vspace{1.2pt}\n      \n     \\textbf{\\normalsize{Back-end:}}{ \\normalsize{Node.js, Express.js, Typescript, Java, Spring Boot, Python, FastAPI, Flask}} \\\\\n      \\vspace{1.2pt}\n      \n     \\textbf{\\normalsize{Banco de dados:}}{ \\normalsize{MongoDB, PostgreSQL, Redis, PrismaORM, H2 Database, SQLServer2005, SQL, Google BigQuery}} \\\\\n     \\vspace{1.2pt}\n\n     \\textbf{\\normalsize{Ferramentas:}}{ \\normalsize{Git, Docker, AWS EC2, AzureDevOps, GitHub Actions, Ollama, ChatGPT, Google Gemini}} \\\\\n     \\vspace{1.2pt}\n\n     \\textbf{\\normalsize{Outros idiomas:}}{ \\normalsize{Inglês}}\n\n     % copy and paste above textbf block to add more \n     }}\n \\end{itemize}\n \\vspace{-16pt}\n \n%  % -----------EXPERIENCE-----------\n% \\section{\\color{airforceblue}EXPERIÊNCIA}\n%   \\resumeSubHeadingListStart\n\n%     \\resumeSubheading \n%         {Desenvolvedor Full Stack}{}\n%         {Equipe SIGA UFRJ, Rio de Janeiro, Brasil}{Março/2024 - Atualmente}\n%         \\resumeItemListStart\n%             \\resumeItem{\\normalsize{Responsável por dar suporte e manutenção aos sistemas da Universidade Federal do Rio de Janeiro, utilizando as tecnologias JBoss SEAM e Java 8;}}\n%             \\resumeItem{\\normalsize{Participação do time responsável na implementação de um novo sistema para integrar os alunos do ensino médio do Colégio de Aplicação - UFRJ, utilizando Spring, React e SQLServer2005.}}\n%         \\resumeItemListEnd\n  \n\n%     \\resumeSubheading\n%       {Treinamento Desenvolvedor Full Stack}{} \n%       {Driven Education, Brasil}{Abril/2022 - Março/2023}\n%       \\resumeItemListStart\n%             \\resumeItem{\\normalsize{Participei de diversos projetos individuais e em grupo com a finalidade de aprender e aprimorar o meu desenvolvimento como programador. Utilizamos as seguintes tecnologias: React, Express.js, MongoDB, PostgreSQL, Node.js, PrismaORM e Jest;}}\n%             \\resumeItem{\\normalsize{Aprendi metodologias ágeis utilizando Scrum;}}  \n%             \\resumeItem{\\normalsize{Desenvolvi competências comportamentais através de aulas de soft skills.}}  \n%       \\resumeItemListEnd  \n\n%     % copy and paste above resumeSubheading block to add more \n%   \\resumeSubHeadingListEnd\n% \\vspace{-12pt}\n\n\n %-----------PROJECTS-----------\n\\section{\\color{airforceblue}PROJETOS}\n    \\resumeSubHeadingListStart\n        \\resumeSubheading{CineMatch - Sistema de Recomendação de Conteúdo}{}\n        {Tecnologias utilizadas: React, Typescript, Vite, Python, FastAPI, PostgreSQL, Docker}{Junho/2024}\n        \\resumeItemListStart\n            \\resumeItem{\\normalsize{Implementei um sistema de recomendações de filmes e seriados para solucionar o tempo perdido ao escolher algum conteúdo para assistir;}}\n            \\resumeItem{\\normalsize{Desenvolvi o projeto para uma disciplina da faculdade, com o objetivo de aprender tecnologias novas na prática.}}\n        \\resumeItemListEnd\n\n\n    \n        \\resumeSubheading {SGO - Sistema de Gestão de Ofertas}{}\n        {Tecnologias utilizadas: Java, Spring Boot, Vue.js, PostgreSQL}{Janeiro/2024 - Fevereiro/2024}\n        \\resumeItemListStart\n            \\resumeItem{\\normalsize{Desenvolvi um sistema para gerenciar as ofertas de iniciações científicas e estágios em uma universidade;}}\n            \\resumeItem{\\normalsize{Gerenciei o projeto com um grupo de 11 pessoas, utilizando metodologias ágeis para dividir as tarefas e coordenar prazos de entrega.}}\n        \\resumeItemListEnd\n\n        % \\resumeSubheading{Boardcamp API}{}{Tecnologias Utilizadas: Java, Spring Boot, PostgreSQL, }{Fevereiro/2024}\n        % \\resumeItemListStart\n        %     \\resumeItem{\\normalsize{Desenvolvi uma API para uma loja locadora de jogos de tabuleiro, utilizando conhecimentos aprendidos em um curso de Java + Spring Boot}}\n        % \\resumeItemListEnd\n        \n        % \\resumeSubheading{Driven.t - Software de Gerenciamento de Evento}{}\n        % {Tecnologias Utilizadas: Node.js, Typescript, React.js, PostgreSQL, Jest, PrismaORM}{Dezembro/2022 - Janeiro/2023}\n        % \\resumeItemListStart\n        %     \\resumeItem{\\normalsize{Desenvolvi uma aplicação para gerenciar um evento, em um time de 4 pessoas, utilizando metodologias ágeis;}}\n        %     \\resumeItem{\\normalsize{Organizei reuniões diárias para alinhar o progresso da equipe e resolver possíveis problemas.}}\n        % \\resumeItemListEnd\n        \n    \\resumeSubHeadingListEnd\n    % \\resumeItemListStart\n    %     \\vspace{0.5pt}\n    %     \\resumeItem{\\normalsize{\\textbf{SGO - Sistema de Gestão de Ofertas}, O projeto consiste em um sistema para gerenciar as ofertas de iniciações científicas e estágios em uma universidade.} \\href{[url to project github repo]}{\\color{blue}\\underline{GitHub}}}\n    %     \\vspace{-5pt}\n        \n    %     \\resumeItem{\\normalsize{\\textbf{Project 2 title}, Vivamus nec consequat nisi. Suspendisse potenti. Sed consectetur elit sed aliquam eleifend. Sed nec quam et urna placerat placerat.} \\href{[url to project demo]}{\\color{blue}\\underline{Try it!}}}\n    %     \\vspace{-5pt}\n\n    %     \\resumeItem{\\normalsize{\\textbf{Project 3 title}, Cras dignissim justo vitae dui vehicula, sed malesuada risus semper. Maecenas suscipit sapien nec ultrices consequat. Sed volutpat justo id magna rhoncus, nec ultricies libero ultrices. Sed malesuada efficitur sapien, a ultricies nulla posuere nec.}  \\href{[url to github repo]}{\\color{blue}\\underline{GitHub}}}\n    %     \\vspace{-5pt}\n\n    %     \\resumeItem{\\normalsize{\\textbf{Project 4 title}, Sed sagittis consectetur eros, eu auctor felis lobortis vel. Sed eu risus at nunc viverra finibus. Curabitur eu quam libero. Sed euismod ante in tellus efficitur, sit amet accumsan mi sodales.} \\href{[url to project demo]}{\\color{blue}\\underline{Try it!}}}\n\n    %     % copy and paste above resumeItem block to add more \n        \n    % \\resumeItemListEnd  \n   \n \\vspace{-12pt}\n%\n\n% %-----------Publications---------------\n% \\section{\\color{airforceblue}PUBLICATIONS}\n    \n%   \\resumeItemListStart\n%     \\resumeItem{\\normalsize{Add Publication details here}}\\href{[url link to publication]}{\\color{blue}\\underline{Link}}\n%     \\vspace{-5pt}\n    \n%     \\resumeItem{\\normalsize{Add Publication details here}}\\href{[url link to publication]}{\\color{blue}\\underline{Link}}\n%     \\vspace{-5pt}\n\n%     % copy and paste above resumeItem block to add more \n    \n%   \\resumeItemListEnd \n      \n% \\vspace{-8pt}\n\n% %-----------EXTRACURRICULAR---------------\n% \\section{\\color{airforceblue}EXTRACURRICULAR ACTIVITIES}\n    \n%       \\resumeItemListStart\n%         \\resumeItem{\\normalsize{\\textbf{Event Coordinator} in univesrity Club - {Month Year - Month Year} }} \n%         \\vspace{-5pt}\n        \n%         \\resumeItem{\\normalsize{\\textbf{Executive member} in Robotics Club - } {Month Year - Month Year}}    \n%         \\vspace{-5pt}\n\n%         % copy and paste above resumeItem block to add more \n%       \\resumeItemListEnd \n\\end{document}"
  }
}